## Joins

In [47]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [48]:
%sql sqlite:///db1.db

'Connected: @db1.db'

In [49]:
%sql select name from sqlite_master where type = 'table';

 * sqlite:///db1.db
Done.

[('cities',),
 ('countries',),
 ('countries_plus',),
 ('currencies',),
 ('economies',),
 ('economies2010',),
 ('economies2015',),
 ('languages',),
 ('populations',)]

### Inner Joins

In [50]:
%sql select * from cities limit 5;

 * sqlite:///db1.db
Done.

[('Abidjan', 'CIV', 4765000, None, 4765000),
 ('Abu Dhabi', 'ARE', 1145000, None, 1145000),
 ('Abuja', 'NGA', 1235880, 6000000, 1235880),
 ('Accra', 'GHA', 2070463, 4010054, 2070463),
 ('Addis Ababa', 'ETH', 3103673, 4567857, 3103673)]

In [51]:
%sql select * from countries limit 5;

 * sqlite:///db1.db
Done.

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Kabul', 69.1761, 34.5228),
 ('NLD', 'Netherlands', 'Europe', 'Western Europe', 41526.0, 1581, 'Nederland', 'Constitutional Monarchy', 'Amsterdam', 4.89095, 52.3738),
 ('ALB', 'Albania', 'Europe', 'Southern Europe', 28748.0, 1912, 'Shqiperia', 'Republic', 'Tirane', 19.8172, 41.3317),
 ('DZA', 'Algeria', 'Africa', 'Northern Africa', 2381740.0, 1962, 'Al-Jaza\x92ir/Algerie', 'Republic', 'Algiers', 3.05097, 36.7397),
 ('ASM', 'American Samoa', 'Oceania', 'Polynesia', 199.0, None, 'Amerika Samoa', 'US Territory', 'Pago Pago', -170.69099999999997, -14.2846)]

#### Inner join the cities table on the left to the countries table on the right, keeping all of the fields in both tables

In [52]:
%sql select * from cities inner join countries on cities.country_code = countries.code limit 5;

 * sqlite:///db1.db
Done.

[('Abidjan', 'CIV', 4765000, None, 4765000, 'CIV', "Cote d'Ivoire", 'Africa', 'Western Africa', 322463.0, 1960, 'Cote d\x92Ivoire', 'Republic', 'Yamoussoukro', -4.0305, 5.332000000000001),
 ('Abu Dhabi', 'ARE', 1145000, None, 1145000, 'ARE', 'United Arab Emirates', 'Asia', 'Middle East', 83600.0, 1971, 'Al-Imarat al-´Arabiya al-Muttahida', 'Emirate Federation', 'Abu Dhabi', 54.3705, 24.4764),
 ('Abuja', 'NGA', 1235880, 6000000, 1235880, 'NGA', 'Nigeria', 'Africa', 'Western Africa', 923768.0, 1960, 'Nigeria', 'Federal Republic', 'Abuja', 7.48906, 9.05804),
 ('Accra', 'GHA', 2070463, 4010054, 2070463, 'GHA', 'Ghana', 'Africa', 'Western Africa', 238533.0, 1957, 'Ghana', 'Republic', 'Accra', -0.20795, 5.57045),
 ('Addis Ababa', 'ETH', 3103673, 4567857, 3103673, 'ETH', 'Ethiopia', 'Africa', 'Eastern Africa', 1104300.0, -1000, 'YeItyop´iya', 'Republic', 'Addis Ababa', 38.7468, 9.022739999999999)]

In [53]:
%%sql
select cities.name as city, countries.Country_name as country, region
from cities inner join countries
on cities.country_code = countries.code
limit 5

 * sqlite:///db1.db
Done.

[('Abidjan', "Cote d'Ivoire", 'Western Africa'),
 ('Abu Dhabi', 'United Arab Emirates', 'Middle East'),
 ('Abuja', 'Nigeria', 'Western Africa'),
 ('Accra', 'Ghana', 'Western Africa'),
 ('Addis Ababa', 'Ethiopia', 'Eastern Africa')]

In [54]:
%sql select * from economies limit 5;

 * sqlite:///db1.db
Done.

[(1, 'AFG', 2010, 'Low income', 539.6669999999999, 37.133, 2.1790000000000003, 30.401999999999997, None, 46.394, 24.381),
 (2, 'AFG', 2015, 'Low income', 615.091, 21.465999999999998, -1.5490000000000002, 18.602, None, -49.11, -7.294),
 (3, 'AGO', 2010, 'Upper middle income', 3599.27, 23.534000000000002, 14.48, 14.433, None, -3.266, -21.076),
 (4, 'AGO', 2015, 'Upper middle income', 3876.2, -0.425, 10.287, 9.552, None, 6.721, -21.778000000000002),
 (5, 'ALB', 2010, 'Upper middle income', 4098.13, 20.011, 3.605, 31.305, 14.0, 10.645, -8.013)]

In [55]:
%%sql
select c.code as country_code, country_name,year,inflation_rate
from countries as c
inner join economies as e
on c.code = e.code
limit 5

 * sqlite:///db1.db
Done.

[('AFG', 'Afghanistan', 2010, 2.1790000000000003),
 ('AFG', 'Afghanistan', 2015, -1.5490000000000002),
 ('NLD', 'Netherlands', 2010, 0.932),
 ('NLD', 'Netherlands', 2015, 0.22),
 ('ALB', 'Albania', 2010, 3.605)]

- Inner join countries (left) and populations (right) on the code and country_code fields respectively.
- Alias countries AS c and populations AS p.
- Select code, name, and region from countries and also select year and fertility_rate from populations (5 fields in total).

In [56]:
%sql select * from populations limit 5;

 * sqlite:///db1.db
Done.

[(20, 'ABW', 2010, 1.704, 74.95353658536591, 101597),
 (19, 'ABW', 2015, 1.6469999999999998, 75.5735853658537, 103889),
 (2, 'AFG', 2010, 5.746, 58.970829268292704, 27962207),
 (1, 'AFG', 2015, 4.6530000000000005, 60.7171707317073, 32526562),
 (12, 'AGO', 2010, 6.416, 50.654170731707296, 21219954)]

In [57]:
%%sql
select c.code, c.country_name, c.region, p.fertility_rate, p.year from countries as c
inner join populations as p
on c.code = p.country_code
limit 5

 * sqlite:///db1.db
Done.

[('AFG', 'Afghanistan', 'Southern and Central Asia', 5.746, 2010),
 ('AFG', 'Afghanistan', 'Southern and Central Asia', 4.6530000000000005, 2015),
 ('NLD', 'Netherlands', 'Western Europe', 1.79, 2010),
 ('NLD', 'Netherlands', 'Western Europe', 1.71, 2015),
 ('ALB', 'Albania', 'Southern Europe', 1.663, 2010)]

### Inner join with using
When joining tables with common names

In [58]:
%sql select * from languages limit 5;

 * sqlite:///db1.db
Done.

[(1, 'AFG', 'Dari', 50.0, 1),
 (2, 'AFG', 'Pashto', 35.0, 1),
 (3, 'AFG', 'Turkic', 11.0, 0),
 (4, 'AFG', 'Other', 4.0, 0),
 (5, 'ALB', 'Albanian', 98.8, 1)]

Inner join countries on the left and languages on the right with USING(code)

In [59]:
%%sql
select country_name as country, continent, l.name as language, official
from countries as c
inner join languages as l
using (code)
limit 5

 * sqlite:///db1.db
Done.

[('Afghanistan', 'Asia', 'Dari', 1),
 ('Afghanistan', 'Asia', 'Other', 0),
 ('Afghanistan', 'Asia', 'Pashto', 1),
 ('Afghanistan', 'Asia', 'Turkic', 0),
 ('Netherlands', 'Europe', 'Dutch', 1)]

### Self-join
Use the populations table to perform a self-join to calculate the percentage increase in population from 2010 to 2015 for each country code

As joining the populations table to itself, you can alias populations as p1 and also populations as p2. This is good practice whenever you are aliasing and your tables have the same first letter. Note that you are required to alias the tables with self-joins.

In [60]:
%sql select * from populations limit 2;

 * sqlite:///db1.db
Done.

[(20, 'ABW', 2010, 1.704, 74.95353658536591, 101597),
 (19, 'ABW', 2015, 1.6469999999999998, 75.5735853658537, 103889)]

In [61]:
%%sql
select p1.country_code, p1.size as size2010, p2.size as size2015
from populations as p1
inner join populations as p2
on p1.country_code = p2.country_code
limit 5;

 * sqlite:///db1.db
Done.

[('ABW', 101597, 101597),
 ('ABW', 101597, 103889),
 ('ABW', 103889, 101597),
 ('ABW', 103889, 103889),
 ('AFG', 27962207, 27962207)]

Extend the ON in your query to include only those records where the p1.year (2010) matches with p2.year - 5 (2015 - 5 = 2010). This will omit the three entries per country_code that you aren't interested in.

In [62]:
%%sql
select p1.country_code, p1.size as size2010, p2.size as size2015
from populations as p1
inner join populations as p2
on p1.country_code = p2.country_code
and p1.year = p2.year - 5
limit 5;

 * sqlite:///db1.db
Done.

[('ABW', 101597, 103889),
 ('AFG', 27962207, 32526562),
 ('AGO', 21219954, 25021974),
 ('ALB', 2913021, 2889167),
 ('AND', 84419, 70473)]

Add a new field to SELECT, aliased as growth_perc, that calculates the percentage population growth from 2010 to 2015 for each country, using p2.size and p1.size.

In [63]:
%%sql
select p1.country_code, p1.size as size2010, p2.size as size2015,
(p2.size - p1.size)/ ((p1.size*1.0))*100 AS growth_perc
from populations as p1
inner join populations as p2
on p1.country_code = p2.country_code
and p1.year = p2.year - 5
limit 5;

 * sqlite:///db1.db
Done.

[('ABW', 101597, 103889, 2.255972125161176),
 ('AFG', 27962207, 32526562, 16.3233002316305),
 ('AGO', 21219954, 25021974, 17.917192468937493),
 ('ALB', 2913021, 2889167, -0.8188749754979453),
 ('AND', 84419, 70473, -16.519977730131842)]

### CASE
Using the countries table, create a new field AS geosize_group that groups the countries into three groups:

- If surface_area is greater than 2 million, geosize_group is 'large'.
- If surface_area is greater than 350 thousand but not larger than 2 million, geosize_group is 'medium'.
- Otherwise, geosize_group is 'small'

In [64]:
%sql select * from countries limit 5;

 * sqlite:///db1.db
Done.

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Kabul', 69.1761, 34.5228),
 ('NLD', 'Netherlands', 'Europe', 'Western Europe', 41526.0, 1581, 'Nederland', 'Constitutional Monarchy', 'Amsterdam', 4.89095, 52.3738),
 ('ALB', 'Albania', 'Europe', 'Southern Europe', 28748.0, 1912, 'Shqiperia', 'Republic', 'Tirane', 19.8172, 41.3317),
 ('DZA', 'Algeria', 'Africa', 'Northern Africa', 2381740.0, 1962, 'Al-Jaza\x92ir/Algerie', 'Republic', 'Algiers', 3.05097, 36.7397),
 ('ASM', 'American Samoa', 'Oceania', 'Polynesia', 199.0, None, 'Amerika Samoa', 'US Territory', 'Pago Pago', -170.69099999999997, -14.2846)]

In [65]:
%%sql
SELECT country_name, continent, code, surface_area,
    CASE WHEN surface_area > 2000000 THEN 'large'
        WHEN surface_area > 350000 THEN 'medium'
        ELSE 'small' END
        AS geosize_group
FROM countries
limit 5;

 * sqlite:///db1.db
Done.

[('Afghanistan', 'Asia', 'AFG', 652090.0, 'medium'),
 ('Netherlands', 'Europe', 'NLD', 41526.0, 'small'),
 ('Albania', 'Europe', 'ALB', 28748.0, 'small'),
 ('Algeria', 'Africa', 'DZA', 2381740.0, 'large'),
 ('American Samoa', 'Oceania', 'ASM', 199.0, 'small')]

Using the populations table focused only for the year 2015, create a new field AS popsize_group to organize population size into

- 'large' (> 50 million),
- 'medium' (> 1 million), and
- 'small' groups.

In [66]:
%%sql 
SELECT country_code, size,
    CASE WHEN  size > 50000000 THEN 'large'
        WHEN size > 1000000 THEN 'medium'
        ELSE 'small' END
        AS popsize_group
FROM populations
WHERE year = 2015
limit 5;

 * sqlite:///db1.db
Done.

[('ABW', 103889, 'small'),
 ('AFG', 32526562, 'medium'),
 ('AGO', 25021974, 'medium'),
 ('ALB', 2889167, 'medium'),
 ('AND', 70473, 'small')]

Use INTO to save the result of the previous query as pop_plus.

In [67]:
%%sql
SELECT country_code, size,
    CASE WHEN size > 50000000 THEN 'large'
        WHEN size > 1000000 THEN 'medium'
        ELSE 'small' END
        AS popsize_group
FROM populations
WHERE year = 2015
limit 5;

 * sqlite:///db1.db
Done.

[('ABW', 103889, 'small'),
 ('AFG', 32526562, 'medium'),
 ('AGO', 25021974, 'medium'),
 ('ALB', 2889167, 'medium'),
 ('AND', 70473, 'small')]

### Left Join
Perform inner join and a left join using the cities and countries tables.

Performing an inner join with the cities table on the left and the countries table on the right.

In [68]:
#Select the city name (with alias), the country code,
#the country name (with alias), the region,
#and the city proper population

In [69]:
%%sql
SELECT c1.name AS city, code, c2.country_name AS country,region, city_proper_pop, count(*)
FROM cities AS c1
INNER JOIN countries AS c2
ON c1.country_code = c2.code
ORDER BY code DESC
limit 5;

 * sqlite:///db1.db
Done.

[('Zunyi', 'CHN', 'China', 'Eastern Asia', 6127009, 230)]

Change the code to perform a LEFT JOIN instead of an INNER JOIN

In [70]:
%%sql
SELECT c1.name AS city, code, c2.country_name AS country,region, city_proper_pop,count(*)
FROM cities AS c1
LEFT JOIN countries AS c2
ON c1.country_code = c2.code
ORDER BY code DESC;

 * sqlite:///db1.db
Done.

[('Zunyi', 'CHN', 'China', 'Eastern Asia', 6127009, 236)]

Use AVG() function in combination with left join to determine the average gross domestic product (GDP) per capita by region in 2010.

In [71]:
%sql select count(*) from countries

 * sqlite:///db1.db
Done.

[(206,)]

In [72]:
%sql select count(*) from economies

 * sqlite:///db1.db
Done.

[(380,)]

In [73]:
%%sql 
SELECT country_name, region, gdp_percapita
FROM countries AS c
LEFT JOIN economies AS e
ON c.code = e.code
WHERE year = 2010
limit 5;

 * sqlite:///db1.db
Done.

[('Afghanistan', 'Southern and Central Asia', 539.6669999999999),
 ('Netherlands', 'Western Europe', 50433.31),
 ('Albania', 'Southern Europe', 4098.13),
 ('Algeria', 'Northern Africa', 4480.72),
 ('Angola', 'Central Africa', 3599.27)]